app/controllers/admin/idiom_controller.rb

SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def show
        @idiom = Idiom.find(params[:id])

SELECT "idioms".* FROM "idioms"
---
    def index
        @idioms = Idiom.all

SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "idioms" SET "body" = $1, "grammatical_type" = $2, "updated_at" = $3 WHERE "idioms"."id" = $4  [["body", "ea"], ["grammatical_type", nil], ["updated_at", "2021-12-09 10:00:17.774743"], ["id", 6]]
---
    def update
        @idiom = Idiom.find(params[:id])
        @idiom.update(validated: params[:submit])

SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def edit
        @idiom = Idiom.find(params[:id])