app/views/admin/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."idiom_id" = $1  [["idiom_id", 1]]
SELECT COUNT(*) FROM "unlikes" WHERE "unlikes"."idiom_id" = $1  [["idiom_id", 1]]
---
        Example : <%=idiom.example%><br>
        <%= idiom.likes.count %> <%= (idiom.likes.count) == 1 ? "Adorateur" : "Adorateurs"%> || <%= idiom.unlikes.count %> <%= (idiom.unlikes.count) == 1 ? "Détracteur" : "Détracteurs"%>