app/views/idioms/_like.html.erb

<div style="float: left;">
  <% pre_like = idiom.likes.find { |like| like.user_id == current_user.id} rescue nil %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."idiom_id" = $1  [["idiom_id", 1]]

      <%= button_to idiom_like_path(idiom, pre_like), method: :delete, class: "button__likes--index button__info--index" do %>
        <span style="font-size: 16px;"><%= idiom.likes.count %></span>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."idiom_id" = $1  [["idiom_id", 1]]