app/views/idioms/_unlike.html.erb

<div style="float: left;">
  <% pre_unlike = idiom.unlikes.find { |unlike| unlike.user_id == current_user.id} rescue nil %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT "unlikes".* FROM "unlikes" WHERE "unlikes"."idiom_id" = $1  [["idiom_id", 67]]

    <%= button_to idiom_unlike_path(idiom, pre_unlike), method: :delete, class: "button__likes--index button__info--index" do %>
    <span style="font-size: 16px;"><%= idiom.unlikes.count %></span>
---
SELECT COUNT(*) FROM "unlikes" WHERE "unlikes"."idiom_id" = $1  [["idiom_id", 67]]