app/views/idioms/show.html.erb


<% @idiom.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."idiom_id" = $1  [["idiom_id", 67]]