app/controllers/admin_controller.rb

  def index
    @user = User.all
    @idiom = Idiom.all
---
SELECT "idioms".* FROM "idioms"

  def update
    @idiom = Idiom.find(params[:id])
    if @idiom.update('validated' => true)
---
SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "idioms" SET "validated" = $1, "updated_at" = $2 WHERE "idioms"."id" = $3  [["validated", true], ["updated_at", "2021-12-09 10:47:00.461972"], ["id", 17]]