app/controllers/comments_controller.rb

SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "idiom_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "dsdsd"], ["user_id", 35], ["idiom_id", 32], ["created_at", "2021-12-07 11:05:50.578865"], ["updated_at", "2021-12-07 11:05:50.578865"]]
---
    def create
        @idiom = Idiom.find(params[:idiom_id])
        @comment = @idiom.comments.create(body: params[:comments][:body], user: current_user,idiom: params[@idiom])

SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
    def update
        @idiom = Idiom.find(params[:idiom_id])

SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 67], ["LIMIT", 1]]
---
    def find_idiom
        @idiom = Idiom.find(params[:idiom_id])