app/controllers/idioms_controller.rb

  def create
    @idiom = Idiom.create(title_en: params[:idioms][:title_en], title_fr: params[:idioms][:title_fr],
      grammatical_type: params[:idioms][:grammatical_type], body: params[:idioms][:body], example: params[:idioms][:example], user: current_user)
---
INSERT INTO "idioms" ("title_en", "title_fr", "grammatical_type", "body", "example", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @idiom = Idiom.find(params[:id])
---
SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

  def destroy
    @idiom = Idiom.find(params[:id])
    @idiom.destroy
---
DELETE FROM "idioms" WHERE "idioms"."id" = $1  [["id", 1]]