app/controllers/idioms_controller.rb

SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
---
  def show
    @idiom = Idiom.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
def index
  @index_idioms = Idiom.where(validated: true)
  if params[:user_id].nil?
    @idioms_ = @index_idioms.search_by(params[:search])
  else
    @user = User.find(params[:user_id])
    @idioms_ = @index_idioms.where(user: @user)

INSERT INTO "idioms" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 11], ["created_at", "2021-12-09 10:25:23.991862"], ["updated_at", "2021-12-09 10:25:23.991862"]]
UPDATE "idioms" SET "title_en" = $1, "title_fr" = $2, "grammatical_type" = $3, "body" = $4, "example" = $5, "user_id" = $6, "validated" = $7, "updated_at" = $8 WHERE "idioms"."id" = $9  [["title_en", nil], ["title_fr", nil], ["grammatical_type", nil], ["body", nil], ["example", nil], ["user_id", 11], ["validated", nil], ["updated_at", "2021-12-09 10:15:58.172526"], ["id", 9]]
---
  def create
    @idiom = Idiom.create(
      title_en: params[:idioms][:title_en],
      title_fr: params[:idioms][:title_fr],
      grammatical_type: params[:idioms][:grammatical_type],
      body: params[:idioms][:body],
      example_fr: params[:idioms][:example_fr],
      example_en: params[:idioms][:example_en],
      user: current_user
    )

    if @idiom.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    if current_user.admin == true || current_user == @idiom.user
      @idiom = Idiom.find(params[:id])

SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "idioms" SET "title_en" = $1, "title_fr" = $2, "grammatical_type" = $3, "body" = $4, "example" = $5, "user_id" = $6, "validated" = $7, "updated_at" = $8 WHERE "idioms"."id" = $9  [["title_en", nil], ["title_fr", nil], ["grammatical_type", nil], ["body", nil], ["example", nil], ["user_id", 11], ["validated", nil], ["updated_at", "2021-12-09 10:15:58.172526"], ["id", 9]]
---
  def update
    @idiom = Idiom.find(params[:id])
    if @idiom.update(
      title_en: params[:idiom][:title_en],
      title_fr: params[:idiom][:title_fr],
      grammatical_type: params[:idiom][:grammatical_type],
      body: params[:idiom][:body],
      example_fr: params[:idiom][:example_fr],
      example_en: params[:idiom][:example_en],
      user: current_user
    )

SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "idioms" WHERE "idioms"."id" = $1  [["id", 1]]
---
  def destroy
    @idiom = Idiom.find(params[:id])
    @idiom.destroy