app/controllers/likes_controller.rb

  def find_idiom
    @idiom = Idiom.find(params[:idiom_id])
---
SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]