app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "idiom_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 11], ["idiom_id", 2], ["created_at", "2021-12-07 11:12:19.757872"], ["updated_at", "2021-12-07 11:12:19.757872"]]
---
  def create
    if already_liked?
      flash[:notice] = "Nos expressions ne sont pas polyamoureuses"
    else
      @idiom.likes.create(user: current_user)

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 6]]
---
  def destroy
    if !(already_liked?)
      flash[:notice] = "Tu ne peux détester ce que tu n'aimes pas"
    else
      @like.destroy

SELECT  "idioms".* FROM "idioms" WHERE "idioms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_idiom
    @idiom = Idiom.find(params[:idiom_id])

SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."idiom_id" = $2 LIMIT $3  [["user_id", 11], ["idiom_id", 2], ["LIMIT", 1]]
---
  def already_liked?
    Like.where(user: current_user, idiom: @idiom).exists?

SELECT  "likes".* FROM "likes" WHERE "likes"."idiom_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["idiom_id", 2], ["id", 6], ["LIMIT", 1]]
---
  def find_like
    @like = @idiom.likes.find(params[:id])