app/controllers/users_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 11]]
SELECT "idioms".* FROM "idioms" WHERE "idioms"."user_id" = $1  [["user_id", 11]]
---
  def show
    @likes = Like.where(user: @user)
    @idioms = Idiom.where(user: @user)